app/views/wheels/new.html.erb

SELECT "sections".* FROM "sections"
---

<% Section.all.each do |s| %>