app/views/wheels/show.html.erb

SELECT "answers".* FROM "answers" INNER JOIN "answers_wheels" ON "answers"."id" = "answers_wheels"."answer_id" WHERE "answers_wheels"."wheel_id" = $1  [["wheel_id", 1]]
SELECT "sections".* FROM "sections"
---

<% @wheel.answers.group_by(&:section).each do |section, answers| %>