app/views/wheels/show.json.erb

{
 "name": "wheel of life",
   "children": [
<% @sections.each do |section| %>
<%= nest(2, {}, section.section_name).to_json.html_safe %>
<% end %>
}


---
SELECT "sections".* FROM "sections"