app/controllers/wheels_controller.rb

	def new
  	@answers = Answer.find_by_id(params[:question_id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 1]]

  def create
    @user = User.find_by_id(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1