app/controllers/wheels_controller.rb

	def show
    @wheel = Wheel.find(params[:id])
    @selected_answer_values = @wheel.answers.map(&:answer_value)
    @selected_answer_id = @wheel.answers.map(&:id)
    @selected_answers = @wheel.answers
    @sections =Section.all
---
SELECT "wheels".* FROM "wheels" WHERE "wheels"."id" = $1 LIMIT 1  [["id", "7"]]
SELECT "answers".* FROM "answers" INNER JOIN "answers_wheels" ON "answers"."id" = "answers_wheels"."answer_id" WHERE "answers_wheels"."wheel_id" = $1  [["wheel_id", 1]]
SELECT "sections".* FROM "sections"

  def create
    @wheel = Wheel.new

    # raise params[:answer].inspect
    if params[:answer].nil? || (params[:answer].length < Question.all.count)
      flash[:error] = 'Please fill out all the answers'
      render 'new'
    else
      # @user = User.find(params[:user_id])

      @answer_ids = params[:answer].values


      @answer_ids.each do |answer_id|
        @wheel.answers << Answer.find(answer_id)
---
SELECT COUNT(*) FROM "questions"
INSERT INTO "wheels" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", Thu, 31 Oct 2013 15:59:44 UTC +00:00], ["updated_at", Thu, 31 Oct 2013 15:59:44 UTC +00:00]]
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", "5"]]